# Коды погоды и их описания
WEATHER_CODES = {
    0: {'desc': 'Ясно', 'icon': '☀️'},
    1: {'desc': 'Преимущественно ясно', 'icon': '🌤'},
    2: {'desc': 'Переменная облачность', 'icon': '⛅'},
    3: {'desc': 'Пасмурно', 'icon': '☁️'},
    45: {'desc': 'Туман', 'icon': '🌫'},
    48: {'desc': 'Изморозь', 'icon': '🌫'},
    51: {'desc': 'Легкая морось', 'icon': '🌧'},
    53: {'desc': 'Умеренная морось', 'icon': '🌧'},
    55: {'desc': 'Сильная морось', 'icon': '🌧'},
    56: {'desc': 'Ледяная морось', 'icon': '🌨'},
    57: {'desc': 'Сильная ледяная морось', 'icon': '🌨'},
    61: {'desc': 'Небольшой дождь', 'icon': '🌦'},
    63: {'desc': 'Умеренный дождь', 'icon': '🌧'},
    65: {'desc': 'Сильный дождь', 'icon': '🌧'},
    66: {'desc': 'Ледяной дождь', 'icon': '🌨'},
    67: {'desc': 'Сильный ледяной дождь', 'icon': '🌨'},
    71: {'desc': 'Небольшой снег', 'icon': '❄️'},
    73: {'desc': 'Умеренный снег', 'icon': '❄️'},
    75: {'desc': 'Сильный снег', 'icon': '❄️'},
    77: {'desc': 'Снежные зерна', 'icon': '❄️'},
    80: {'desc': 'Небольшой ливень', 'icon': '🌦'},
    81: {'desc': 'Умеренный ливень', 'icon': '🌧'},
    82: {'desc': 'Сильный ливень', 'icon': '🌧'},
    85: {'desc': 'Небольшой снегопад', 'icon': '🌨'},
    86: {'desc': 'Сильный снегопад', 'icon': '🌨'},
    95: {'desc': 'Гроза', 'icon': '⛈'},
    96: {'desc': 'Гроза с градом', 'icon': '⛈'},
    99: {'desc': 'Сильная гроза с градом', 'icon': '⛈'}
}

# Константы для API
API_TIMEOUT = 5
CACHE_TIMEOUT = 60 * 60 * 24  # 24 часа
